import { DisciplineKind } from '../model';

export const disciplineKinds: DisciplineKind[] = [
  {
    name: 'Лекція',
    id: 1,
  },
  {
    name: 'Лабораторна',
    id: 2,
  },
  {
    name: 'Практичне заняття',
    id: 3,
  },
  {
    name: 'Семінар',
    id: 4,
  },
  {
    name: 'Поточна консультація',
    id: 5,
  },
  {
    name: 'Екзаменаційна консультація',
    id: 6,
  },
  {
    name: 'Керівництво курсовою роботою (проєктом)',
    id: 7,
  },
  {
    name: 'Керівництво бакалаврською роботою',
    id: 8,
  },
  {
    name: 'Керівництво магістерською роботою',
    id: 9,
  },
  {
    name: 'Рецензування кваліфікаційних робіт',
    id: 10,
  },
  {
    name: 'Нормоконтроль',
    id: 11,
  },
  {
    name: 'Екзаменаційна комісія',
    id: 12,
  },
  {
    name: 'Керівництво практикою',
    id: 13,
  },
  {
    name: 'Конференція (практика)',
    id: 14,
  },
  {
    name: 'Керівництво аспірантами (докторантами)',
    id: 15,
  },
  {
    name: 'Екзамен',
    id: 16,
  },
  {
    name: 'Залік',
    id: 17,
  },
];
