import { Faculty } from '../model';

export const faculties: Faculty[] = [
  {
    id: 1,
    name: 'Біологічний',
    departments: [
      {
        id: 1,
        name: 'Біології лісу, мисливствознавства та іхтіології',
      },
      {
        id: 2,
        name: 'Загальної та прикладної екології і зоології',
      },
      {
        id: 3,
        name: 'Генетики та рослинних ресурсів',
      },
      {
        id: 4,
        name: 'Фізіології, імунології та біохімії з курсом ЦЗ і медицини',
      },
      {
        id: 5,
        name: 'Хімії',
      },
    ],
  },
  {
    id: 2,
    name: 'Математичний',
    departments: [
      {
        id: 6,
        name: 'Загальної математики',
      },
      {
        id: 7,
        name: 'Загальної та прикладної фізики',
      },
      {
        id: 8,
        name: 'Комп`ютерних наук',
      },
      {
        id: 9,
        name: 'Програмної інженерії',
      },
      {
        id: 10,
        name: 'Фундаментальної та прикладної математики',
      },
    ],
  },
  {
    id: 3,
    name: 'Економічний',
    departments: [
      {
        id: 11,
        name: 'Економічної кібернетики',
      },
      {
        id: 12,
        name: 'Міжнародної економіки',
      },
      {
        id: 13,
        name: 'Обліку та оподаткування',
      },
      {
        id: 14,
        name: 'Управління персоналом і маркетингу',
      },
      {
        id: 15,
        name: 'Фінансів, банківської справи та страхування',
      },
    ],
  },
  {
    id: 4,
    name: 'СПП',
    departments: [
      {
        id: 16,
        name: 'Акторської майстерності',
      },
      {
        id: 17,
        name: 'Дошкільної та початкової освіти',
      },
      {
        id: 18,
        name: 'Дизайну',
      },
      {
        id: 19,
        name: 'Педагогіки та психології освітньої діяльності',
      },
      {
        id: 20,
        name: 'Психології',
      },
      {
        id: 21,
        name: 'Соціальної педагогіки та спец. освіти',
      },
    ],
  },
  {
    id: 5,
    name: 'Філологічний',
    departments: [
      {
        id: 22,
        name: 'Слов`янської філології',
      },
      {
        id: 23,
        name: 'Українознавства',
      },
      {
        id: 24,
        name: 'Української літератури',
      },
      {
        id: 25,
        name: 'Української мови',
      },
    ],
  },
  {
    id: 6,
    name: 'Журналістики',
    departments: [
      {
        id: 26,
        name: 'Видавничої справи та редагування',
      },
      {
        id: 27,
        name: 'Журналістики',
      },
      {
        id: 28,
        name: 'Cоціальних комунікацій та інформаційної діяльності',
      },
    ],
  },
  {
    id: 7,
    name: 'ФФВ',
    departments: [
      {
        id: 29,
        name: 'Теорії та методики фізичної культури і спорту',
      },
      {
        id: 30,
        name: 'Медико-біологічних основ фізичного виховання та спорту',
      },
      {
        id: 31,
        name: 'Фізичної культури і спорту',
      },
      {
        id: 32,
        name: 'Туризму та готельно-ресторанної справи',
      },
      {
        id: 33,
        name: 'Фізичної терапії та ерготерапії',
      },
    ],
  },
  {
    id: 8,
    name: 'Історії та міжнародних відносин',
    departments: [
      {
        id: 34,
        name: 'Джерелознавчих студій та суспільниї комунікацій',
      },
      {
        id: 35,
        name: 'Давньої і нової історії України та методики навчання історії',
      },
      {
        id: 36,
        name: 'Новітньої історії України',
      },
      {
        id: 37,
        name: 'Всесвітньої історії та міжнародних відносин',
      },
    ],
  },
  {
    id: 9,
    name: 'ФІФ',
    departments: [
      {
        id: 38,
        name: 'Німецької філології, перекладу та світової літератури',
      },
      {
        id: 39,
        name: 'Романської філології і перекладу',
      },
      {
        id: 40,
        name: 'Викладання другої іноземної мови',
      },
      {
        id: 41,
        name: 'Іноземних мов професійного спрямування',
      },
      {
        id: 42,
        name: 'Теорії та практики перекладу з англійської мови',
      },
      {
        id: 43,
        name: 'Англійської філології та лінгводидактики',
      },
    ],
  },
  {
    id: 10,
    name: 'Менеджменту',
    departments: [
      {
        id: 44,
        name: 'Бізнес-адміністрування і менеджменту зовнішньоекономічної діяльності',
      },
      {
        id: 45,
        name: 'Ділової комунікації',
      },
      {
        id: 46,
        name: 'Підприємництва, менеджменту організацій та логістики',
      },
    ],
  },
  {
    id: 11,
    name: 'ФСУ',
    departments: [
      {
        id: 47,
        name: 'Політології',
      },
      {
        id: 48,
        name: 'Соціології',
      },
      {
        id: 49,
        name: 'Соціальної філософії та управління',
      },
    ],
  },
  {
    id: 12,
    name: 'Юридичний',
    departments: [
      {
        id: 50,
        name: 'Конституційного та адміністративного права',
      },
      {
        id: 51,
        name: 'Історії і теорії держави та права',
      },
      {
        id: 52,
        name: 'Кримінального права та правосуддя',
      },
      {
        id: 53,
        name: 'Цивільного права',
      },
    ],
  },
  {
    id: 13,
    name: 'ІННІ',
    departments: [
      {
        id: 55,
        name: 'Електричної інженерії та кіберфізичних систем',
      },
      {
        id: 56,
        name: 'Інформаційної економіки, підприємництва та фінансів',
      },
      {
        id: 57,
        name: 'Менеджменту організацій та управління проектами',
      },
      {
        id: 58,
        name: 'Металургійних технологій, екології та техногенної безпеки',
      },
      {
        id: 59,
        name: 'Металургійного обладнання',
      },
      {
        id: 60,
        name: 'Електроніки, інформаційних систем та програмного забезпечення',
      },
      {
        id: 61,
        name: 'Міського будівництва та архітектури',
      },
      {
        id: 62,
        name: 'Обліку, аналізу, оподаткування та аудиту',
      },
      {
        id: 63,
        name: 'Промислового та цивільного будівництва',
      },
      {
        id: 64,
        name: 'Теплоенергетики та гідроенергетики',
      },
    ],
  },
];
